stress-test/pilot-final-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 2m0s (gracefulStop: 30s)

time="2026-01-16T13:40:50-05:00" level=info msg="🔐 Configurando prueba de estrés con bypass de autenticación..." source=console
time="2026-01-16T13:40:50-05:00" level=info msg="✅ Bypass configurado exitosamente" source=console

running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m01.0s/2m0s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m02.0s/2m0s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m03.0s/2m0s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m04.0s/2m0s

running (0m05.0s), 100/100 VUs, 4 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m05.0s/2m0s

running (0m06.0s), 100/100 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m06.0s/2m0s

running (0m07.0s), 100/100 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m07.0s/2m0s

running (0m08.0s), 100/100 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m08.0s/2m0s

running (0m09.0s), 100/100 VUs, 44 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m09.0s/2m0s

running (0m10.0s), 100/100 VUs, 78 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m10.0s/2m0s

running (0m11.0s), 100/100 VUs, 108 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m11.0s/2m0s

running (0m12.0s), 100/100 VUs, 136 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m12.0s/2m0s

running (0m13.0s), 100/100 VUs, 154 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m13.0s/2m0s

running (0m14.0s), 100/100 VUs, 181 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m14.0s/2m0s

running (0m15.0s), 100/100 VUs, 214 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m15.0s/2m0s

running (0m16.0s), 100/100 VUs, 237 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m16.0s/2m0s

running (0m17.0s), 100/100 VUs, 259 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m17.0s/2m0s

running (0m18.0s), 100/100 VUs, 292 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m18.0s/2m0s

running (0m19.0s), 100/100 VUs, 320 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m19.0s/2m0s

running (0m20.0s), 100/100 VUs, 348 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m20.0s/2m0s

running (0m21.0s), 100/100 VUs, 375 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m21.0s/2m0s

running (0m22.0s), 100/100 VUs, 406 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m22.0s/2m0s

running (0m23.0s), 100/100 VUs, 433 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m23.0s/2m0s

running (0m24.0s), 100/100 VUs, 461 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m24.0s/2m0s

running (0m25.0s), 100/100 VUs, 488 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m25.0s/2m0s

running (0m26.0s), 100/100 VUs, 512 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m26.0s/2m0s

running (0m27.0s), 100/100 VUs, 543 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m27.0s/2m0s

running (0m28.0s), 100/100 VUs, 571 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m28.0s/2m0s

running (0m29.0s), 100/100 VUs, 591 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  0m29.0s/2m0s

running (0m30.0s), 100/100 VUs, 621 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m30.0s/2m0s

running (0m31.0s), 100/100 VUs, 657 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m31.0s/2m0s

running (0m32.0s), 100/100 VUs, 677 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m32.0s/2m0s

running (0m33.0s), 100/100 VUs, 702 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m33.0s/2m0s

running (0m34.0s), 100/100 VUs, 729 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m34.0s/2m0s

running (0m35.0s), 100/100 VUs, 756 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  0m35.0s/2m0s

running (0m36.0s), 100/100 VUs, 781 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m36.0s/2m0s

running (0m37.0s), 100/100 VUs, 806 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m37.0s/2m0s

running (0m38.0s), 100/100 VUs, 834 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m38.0s/2m0s

running (0m39.0s), 100/100 VUs, 857 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m39.0s/2m0s

running (0m40.0s), 100/100 VUs, 889 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m40.0s/2m0s

running (0m41.0s), 100/100 VUs, 920 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  0m41.0s/2m0s

running (0m42.0s), 100/100 VUs, 943 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m42.0s/2m0s

running (0m43.0s), 100/100 VUs, 968 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m43.0s/2m0s

running (0m44.0s), 100/100 VUs, 987 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m44.0s/2m0s

running (0m45.0s), 100/100 VUs, 1025 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m45.0s/2m0s

running (0m46.0s), 100/100 VUs, 1051 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m46.0s/2m0s

running (0m47.0s), 100/100 VUs, 1075 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  0m47.0s/2m0s

running (0m48.0s), 100/100 VUs, 1107 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m48.0s/2m0s

running (0m49.0s), 100/100 VUs, 1133 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m49.0s/2m0s

running (0m50.0s), 100/100 VUs, 1158 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m50.0s/2m0s

running (0m51.0s), 100/100 VUs, 1178 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m51.0s/2m0s

running (0m52.0s), 100/100 VUs, 1208 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m52.0s/2m0s

running (0m53.0s), 100/100 VUs, 1242 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  0m53.0s/2m0s

running (0m54.0s), 100/100 VUs, 1264 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m54.0s/2m0s

running (0m55.0s), 100/100 VUs, 1288 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m55.0s/2m0s

running (0m56.0s), 100/100 VUs, 1317 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m56.0s/2m0s

running (0m57.0s), 100/100 VUs, 1347 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m57.0s/2m0s

running (0m58.0s), 100/100 VUs, 1373 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m58.0s/2m0s

running (0m59.0s), 100/100 VUs, 1400 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  0m59.0s/2m0s

running (1m00.0s), 100/100 VUs, 1424 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  1m00.0s/2m0s

running (1m01.0s), 100/100 VUs, 1460 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  1m01.0s/2m0s

running (1m02.0s), 100/100 VUs, 1491 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  1m02.0s/2m0s

running (1m03.0s), 100/100 VUs, 1516 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  1m03.0s/2m0s

running (1m04.0s), 100/100 VUs, 1547 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  1m04.0s/2m0s

running (1m05.0s), 100/100 VUs, 1575 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  1m05.0s/2m0s

running (1m06.0s), 100/100 VUs, 1597 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  1m06.0s/2m0s

running (1m07.0s), 100/100 VUs, 1626 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  1m07.0s/2m0s

running (1m08.0s), 100/100 VUs, 1656 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  1m08.0s/2m0s

running (1m09.0s), 100/100 VUs, 1679 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  1m09.0s/2m0s

running (1m10.0s), 100/100 VUs, 1706 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  1m10.0s/2m0s

running (1m11.0s), 100/100 VUs, 1730 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  1m11.0s/2m0s

running (1m12.0s), 100/100 VUs, 1755 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  1m12.0s/2m0s

running (1m13.0s), 100/100 VUs, 1787 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  1m13.0s/2m0s

running (1m14.0s), 100/100 VUs, 1810 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  1m14.0s/2m0s

running (1m15.0s), 100/100 VUs, 1835 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  1m15.0s/2m0s

running (1m16.0s), 100/100 VUs, 1867 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  1m16.0s/2m0s

running (1m17.0s), 100/100 VUs, 1893 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  1m17.0s/2m0s

running (1m18.0s), 100/100 VUs, 1917 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  1m18.0s/2m0s

running (1m19.0s), 100/100 VUs, 1951 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  1m19.0s/2m0s

running (1m20.0s), 100/100 VUs, 1978 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  1m20.0s/2m0s

running (1m21.0s), 100/100 VUs, 2002 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  1m21.0s/2m0s

running (1m22.0s), 100/100 VUs, 2029 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  1m22.0s/2m0s

running (1m23.0s), 100/100 VUs, 2051 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  1m23.0s/2m0s

running (1m24.0s), 100/100 VUs, 2079 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  1m24.0s/2m0s

running (1m25.0s), 100/100 VUs, 2111 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  1m25.0s/2m0s

running (1m26.0s), 100/100 VUs, 2131 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  1m26.0s/2m0s

running (1m27.0s), 100/100 VUs, 2158 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  1m27.0s/2m0s

running (1m28.0s), 100/100 VUs, 2187 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  1m28.0s/2m0s

running (1m29.0s), 100/100 VUs, 2215 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  1m29.0s/2m0s

running (1m30.0s), 100/100 VUs, 2242 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  1m30.0s/2m0s

running (1m31.0s), 100/100 VUs, 2271 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  1m31.0s/2m0s

running (1m32.0s), 100/100 VUs, 2296 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  1m32.0s/2m0s

running (1m33.0s), 100/100 VUs, 2334 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  1m33.0s/2m0s

running (1m34.0s), 100/100 VUs, 2356 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  1m34.0s/2m0s

running (1m35.0s), 100/100 VUs, 2378 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  1m35.0s/2m0s

running (1m36.0s), 100/100 VUs, 2415 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  1m36.0s/2m0s

running (1m37.0s), 100/100 VUs, 2443 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  1m37.0s/2m0s

running (1m38.0s), 100/100 VUs, 2465 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  1m38.0s/2m0s

running (1m39.0s), 100/100 VUs, 2489 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  1m39.0s/2m0s

running (1m40.0s), 100/100 VUs, 2526 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  1m40.0s/2m0s

running (1m41.0s), 100/100 VUs, 2555 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  1m41.0s/2m0s

running (1m42.0s), 100/100 VUs, 2580 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  1m42.0s/2m0s

running (1m43.0s), 100/100 VUs, 2612 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  1m43.0s/2m0s

running (1m44.0s), 100/100 VUs, 2636 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  1m44.0s/2m0s

running (1m45.0s), 100/100 VUs, 2662 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  1m45.0s/2m0s

running (1m46.0s), 100/100 VUs, 2690 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  1m46.0s/2m0s

running (1m47.0s), 100/100 VUs, 2717 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  1m47.0s/2m0s

running (1m48.0s), 100/100 VUs, 2750 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  1m48.0s/2m0s

running (1m49.0s), 100/100 VUs, 2775 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  1m49.0s/2m0s

running (1m50.0s), 100/100 VUs, 2802 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  1m50.0s/2m0s

running (1m51.0s), 100/100 VUs, 2832 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  1m51.0s/2m0s

running (1m52.0s), 100/100 VUs, 2863 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  1m52.0s/2m0s

running (1m53.0s), 100/100 VUs, 2887 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  1m53.0s/2m0s

running (1m54.0s), 100/100 VUs, 2922 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  1m54.0s/2m0s

running (1m55.0s), 100/100 VUs, 2946 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  1m55.0s/2m0s

running (1m56.0s), 100/100 VUs, 2978 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  1m56.0s/2m0s

running (1m57.0s), 100/100 VUs, 2997 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  1m57.0s/2m0s

running (1m58.0s), 100/100 VUs, 3024 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  1m58.0s/2m0s

running (1m59.0s), 100/100 VUs, 3062 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  1m59.0s/2m0s

running (2m00.0s), 100/100 VUs, 3089 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  2m00.0s/2m0s

running (2m01.0s), 077/100 VUs, 3112 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m02.0s), 044/100 VUs, 3145 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m03.0s), 021/100 VUs, 3168 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m04.0s), 007/100 VUs, 3182 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.01' rate=25.543396/s

    http_req_duration
    ✓ 'p(95)<1000' p(95)=315.92ms
    ✗ 'p(99)<2000' p(99)=5.14s

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 7656   61.323375/s
    checks_succeeded...: 48.85% 3740 out of 7656
    checks_failed......: 51.14% 3916 out of 7656

    ✗ pianos status is 200
      ↳  0% — ✓ 0 / ✗ 614
    ✗ response time < 1000ms
      ↳  97% — ✓ 3740 / ✗ 88
    ✗ clients status is 200
      ↳  0% — ✓ 0 / ✗ 1272
    ✗ auth status is 200
      ↳  0% — ✓ 0 / ✗ 639
    ✗ services status is 200
      ↳  0% — ✓ 0 / ✗ 666
    ✗ appointments status is 200
      ↳  0% — ✓ 0 / ✗ 637

    CUSTOM
    errors...............: 3189    25.543396/s

    HTTP
    http_req_duration....: avg=244.53ms min=42.59ms med=111.35ms max=5.94s  p(90)=208.12ms p(95)=315.92ms
    http_req_failed......: 100.00% 3828 out of 3828
    http_reqs............: 3828    30.661688/s

    EXECUTION
    iteration_duration...: avg=3.82s    min=2.06s   med=3.69s    max=11.85s p(90)=4.93s    p(95)=5.12s   
    iterations...........: 3189    25.543396/s
    vus..................: 7       min=7            max=100
    vus_max..............: 100     min=100          max=100

    NETWORK
    data_received........: 1.6 MB  13 kB/s
    data_sent............: 442 kB  3.5 kB/s



running (2m04.8s), 000/100 VUs, 3189 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  2m0s
time="2026-01-16T13:42:55-05:00" level=error msg="thresholds on metrics 'errors, http_req_duration, http_req_failed' have been crossed"